// ==========================================================================================
// Title:       READ TUNAMAL
// Description: Converts Mongolion numeric words to number 😉
// Author:      Batzorig Gonchigsumlaa
// Email:       batz.gg@gmail.com
// Date:        30 Mar 2023
//===========================================================================================

const onesTens = {
    'тэг'       : 0,
    'нэг'       : 1,
    'хоёр'      : 2,
    'гурав'     : 3,
    'дөрөв'     : 4,
    'тав'       : 5,
    'зургаа'    : 6,
    'долоо'     : 7,
    'найм'      : 8,
    'ес'        : 9,
        
    'нэгэн'     : 1,
    'хоёр'      : 2,
    'гурван'    : 3,
    'дөрвөн'    : 4,
    'таван'     : 5,
    'зургаан'   : 6,
    'долоон'    : 7,
    'найман'    : 8,
    'есөн'      : 9,
    
    'арван'     : 10,
    'хорин'     : 20,
    'гучин'     : 30,
    'дөчин'     : 40,
    'тавин'     : 50,
    'жаран'     : 60,
    'далан'     : 70,
    'наян'      : 80,
    'ерэн'      : 90,

    'арав'      : 10,
    'хорь'      : 20,
    'гуч'       : 30,
    'дөч'       : 40,
    'тавь'      : 50,
    'жар'       : 60,
    'дал'       : 70,
    'ная'       : 80,
    'ер'        : 90,
};

const scalePlace = {
    'зуу':      10**2,
    'мянга':    10**3,
    'сая':      10**6,
    'тэрбум':   10**9,
    'их наяд':  10**12,
    'тунамал':  10**15,
};

let a, n, g;

const mn2nm = (s) => {
    a = s.toString().split(/[\s-]+/);
    if ((a[a.indexOf(a.find(e => e === "их"))] + ' ' + a[a.indexOf(a.find(e => e === "наяд"))]) == 'их наяд') {
        a[a.indexOf(a.find(e => e === "их"))] = 'их наяд';
        a = a.filter(x => x != 'наяд');
    }
    n = 0;
    g = 0;
    a.forEach(feach);
    return n + g;
};

const feach = (w) =>{
    let x = onesTens[w];

    if (x != null) {
        g = g + x;
    }
    else if (w == "зуун") {
        g = g * 100;
    }
    else {
        x = scalePlace[w];
        if (x != null) {
            n = n + g * x
            g = 0;
        }
        else { 
            console.log("Таньсангүй: " + w); 
        }
    }
};
